## Staging: oidc_roles
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                               NAME                                                |
|--------|---------------------------------------------------------------------------------------------------|
| add    | `aws_iam_role_policy_attachment.platform_forms_db_migration`                                      |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;platform-forms-client-db-migration&quot;]`            |
| delete | `aws_iam_role_policy_attachment.platform_forms_db_migration_staging[0]`                           |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;platform-forms-client-db-migration-production&quot;]` |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;platform-forms-client-db-migration-staging&quot;]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.platform_forms_db_migration will be created
  + resource "aws_iam_role_policy_attachment" "platform_forms_db_migration" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/platform-forms-client-db-migration"
      + role       = "platform-forms-client-db-migration"
    }

  # aws_iam_role_policy_attachment.platform_forms_db_migration_staging[0] will be destroyed
  # (because aws_iam_role_policy_attachment.platform_forms_db_migration_staging is not in configuration)
  - resource "aws_iam_role_policy_attachment" "platform_forms_db_migration_staging" {
      - id         = "platform-forms-client-db-migration-staging-20250401114328017500000001" -> null
      - policy_arn = "arn:aws:iam::687401027353:policy/platform-forms-client-db-migration" -> null
      - role       = "platform-forms-client-db-migration-staging" -> null
    }

  # module.github_workflow_roles.aws_iam_role.this["platform-forms-client-db-migration"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/platform-forms-client:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-forms-client-db-migration"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github_workflow_roles.aws_iam_role.this["platform-forms-client-db-migration-production"] will be destroyed
  # (because key ["platform-forms-client-db-migration-production"] is not in for_each map)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::687401027353:role/platform-forms-client-db-migration-production" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:cds-snc/platform-forms-client:ref:refs/tags/v*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-01T11:43:27Z" -> null
      - force_detach_policies = false -> null
      - id                    = "platform-forms-client-db-migration-production" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "platform-forms-client-db-migration-production" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA2ADCLI4M4XHUFN6HD" -> null
        # (3 unchanged attributes hidden)
    }

  # module.github_workflow_roles.aws_iam_role.this["platform-forms-client-db-migration-staging"] will be destroyed
  # (because key ["platform-forms-client-db-migration-staging"] is not in for_each map)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::687401027353:role/platform-forms-client-db-migration-staging" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:cds-snc/platform-forms-client:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::687401027353:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-01T11:43:27Z" -> null
      - force_detach_policies = false -> null
      - id                    = "platform-forms-client-db-migration-staging" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "platform-forms-client-db-migration-staging" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA2ADCLI4MR5RUMUWLA" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_db_migration"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.platform_forms_client_pr_review_env[0]"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
